Autodesk.Revit.DB.Wall.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Boolean,Autodesk.Revit.DB.XYZ)
Creates a non rectangular profile wall within the project using the specified wall type and normal vector.
document:
The document in which the new wall is created.
profile:
An array of planar curves that represent the vertical profile of the wall.
wallTypeId:
Id of the wall type to be used by the new wall instead of the default type.
levelId:
Id of the level on which the wall is to be placed.
structural:
If set, specifies that the wall is structural in nature.
normal:
A vector that must be perpendicular to the profile which dictates which side of the wall is considered to be inside and outside.
Returns:
If successful a new wall object within the project.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input profile contains at least one helical curve and is not supported for this operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create the wall.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.

Autodesk.Revit.DB.Wall.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Boolean)
Creates a non rectangular profile wall within the project using the specified wall type.
document:
The document in which the new wall is created.
profile:
An array of planar curves that represent the vertical profile of the wall.
wallTypeId:
Id of the wall type to be used by the new wall instead of the default type.
levelId:
Id of the level on which the wall is to be placed.
structural:
If set, specifies that the wall is structural in nature.
Returns:
If successful a new wall object within the project.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input profile contains at least one helical curve and is not supported for this operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create the wall.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.

Autodesk.Revit.DB.Wall.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.Curve},System.Boolean)
Creates a non rectangular profile wall within the project using the default wall type.
document:
The document in which the new wall is created.
profile:
An array of planar curves that represent the vertical profile of the wall.
structural:
If set, specifies that the wall is structural in nature.
Returns:
If successful a new wall object within the project.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input profile contains at least one helical curve and is not supported for this operation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create the wall.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.

Autodesk.Revit.DB.Wall.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,System.Double,System.Double,System.Boolean,System.Boolean)
Creates a new rectangular profile wall within the project using the specified wall type, height, and offset.
document:
The document in which the new wall is created.
curve:
A curve representing the base line of the wall.
wallTypeId:
Id of the wall type to be used by the new wall instead of the default type.
levelId:
Id of the level on which the wall is to be placed.
height:
The height of the wall other than the default height.
offset:
Modifies the wall's Base Offset parameter to determine its vertical placement.
flip:
Change which side of the wall is considered to be the inside and outside of the wall.
structural:
If set, specifies that the wall is structural in nature.
Returns:
If successful a new wall object within the project.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The curve argument is not valid for wall creation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The given value for height must be greater than 0 and no more than 30000 feet.
-or-
The given value for offset must be no more than 30000 feet in absolute value.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.

Autodesk.Revit.DB.Wall.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.ElementId,System.Boolean)
Creates a new rectangular profile wall within the project using the default wall style.
document:
The document in which the new wall is created.
curve:
A curve representing the base line of the wall.
levelId:
Id of the level on which the wall is to be placed.
structural:
If set, specifies that the wall is structural in nature.
Returns:
If successful a new wall object within the project.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The curve argument is not valid for wall creation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.

Autodesk.Revit.DB.Wall.CanHaveProfileSketch
Checks whether this wall has or can have a profile sketch.
Remarks:
Wall does not support profile if it is not a straight wall; or wall is tapered;
or it is an old curtain wall; or it is an infill wall; or it is a replacement curtain panel.
Returns:
True if wall supports profile sketch, false otherwise.

Autodesk.Revit.DB.Wall.IsWallCrossSectionValid(Autodesk.Revit.DB.WallCrossSection)
Checks whether the desired cross section is valid for the current wall.
wallCrossSection:
The desired cross section.
Returns:
True if the wall can be set to the desired cross section.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2022

Autodesk.Revit.DB.Wall.RemoveProfileSketch
Reverts an edited wall to its original shape.
Remarks:
The wall profile is changed back to its original rectangular profile. All profile changes made in the sketch mode are discarded.
To check if wall sketch can be removed call Autodesk.Revit.DB.Wall.SketchId.
Since:
2022

Autodesk.Revit.DB.Wall.CreateProfileSketch
Creates a new Wall profile Sketch.
Remarks:
The loop of the sketch cannot be obtained until regeneration.
To regenerate the document use Autodesk.Revit.DB.Document.Regenerate.
To edit the Wall profile use Autodesk::Revit::DB::SketchEditScope.
Returns:
Created profile Sketch of the Wall.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Wall does not support profile Sketch as it is not a straight wall; or is tapered;
or it is an old curtain wall; or it is an infill wall; or it is a replacement curtain panel.
-or-
Wall already has a sketch.
Since:
2022

Autodesk.Revit.DB.Wall.CrossSection
Obtain the Wall Cross-section for this wall.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The current wall does not support the cross section wallCrossSection.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2022

Autodesk.Revit.DB.Wall.WallType
Retrieves or changes the type of the wall.
Remarks:
The WallType property can be used to retrieve the kind of the wall.
This property can also be used to change the type of a wall by setting it to a different wall type.
All the wall types in the project can be found using the Document.WallTypes property.
The type of the wall.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The wall type wallType is not valid for the current wall.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null

Autodesk.Revit.DB.Wall.SketchId
Returns id of the profile sketch, or invalidElementId if sketch does not exist.
Remarks:
To create profile Sketch for the Wall, call Autodesk.Revit.DB.Wall.CreateProfileSketch.
Since:
2022